[{"title":"Prodigals: The Anti-Prodigal","sermon_mp3":[{"id":"attJ9lGyEJNUcWpUM","url":"https://dl.airtable.com/EHBB3lfARLWclZ1MoeWn_2016%200619%20sunpm.mp3","filename":"2016 0619 sunpm.mp3","size":33513638,"type":"audio/mp3"}],"series":["recCSWkhDcssIH71H"],"service":"Sunday PM","date":"2016-06-19","bible_text":"Luke 15:25-32","speaker":["reczJXlkg63judAaw"],"speaker_name":["Ryan Hayden"],"speaker_bio":["Ryan Hayden has served as the pastor at Bible Baptist since 2011.  He loves simple, direct, Bible based preaching.  He blogs at pastorryanhayden.com and is the host of the podcast \"The Foolishness of Preaching\" as well as a daily devotional radio show."],"speaker_role":["Pastor"],"speaker_thumbnail":[{"id":"attiOBQEp50XuGPhA","url":"https://dl.airtable.com/LJGYxDMRxuJNDVwB8peA_Photo%20on%205-10-16%20at%206.26%20PM.jpg","filename":"Photo on 5-10-16 at 6.26 PM.jpg","type":"image/jpeg","size":52652,"width":375,"height":375,"smallThumbUrl":"https://dl.airtable.com/BvvqdOhNTveYIc1lb8fP_small_Photo%20on%205-10-16%20at%206.26%20PM.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/alezlQj3Qdm6UQIO2DQR_large_Photo%20on%205-10-16%20at%206.26%20PM.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"series_title":["Prodigals"],"series_description":["The story of the “Prodigal Son” is an amazing parable that reveals a lot about God’s grace, our depravity and the utter failure of religion.  In this mini-series Pastor Hayden is taking a deep look at all of the prodigals in Luke 15 - not just the son."],"series_featured_image":[{"id":"attxzjiqtWZv0n4yD","url":"https://dl.airtable.com/vMUrP6EQX2g5f1IL2tQ1_Screen%20Shot%202016-06-14%20at%203.56.34%20PM.png","filename":"Screen Shot 2016-06-14 at 3.56.34 PM.png","type":"image/png","size":160371,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/FQ6e4NbURyK4veM9pRDd_small_Screen%20Shot%202016-06-14%20at%203.56.34%20PM.png","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/u0HlyRt4QiixYreOShLX_large_Screen%20Shot%202016-06-14%20at%203.56.34%20PM.png","largeThumbWidth":512,"largeThumbHeight":512}],"ten_minutes":0,"updated_or_created_ten_minutes":0,"published":true},{"title":"What Christians Need","body_content":"Tonight we are going to go back to the book of Acts.  It's a basic message - really simple.  But I think it's practical.  I think it's something we need to know.\n\nI'm going to let Adam continue in Genesis while I am gone.\n\nLet's read Acts 14:21-28.\n\n> *\"And when they had preached the gospel to that city, and had taught many, they returned again to Lystra, and to Iconium, and Antioch, Confirming the souls of the disciples, and exhorting then to continue in the faith, and that we must through much tribulation aenter into the Kingdom of God.  And when they had ordained them elders in every church, and had prayed with fasting, they commended them to the Lord, on whom thy believed.  And after they had passed throughout Pisidia, they came to Pamphylia.  And when they had preached the word in Perga, they went down into Attalia: And thence sailed to Antioch, from whence they had been recommended to the grace of God for the work which they fulfilled.  And when they were come, and had gathered the church together, they rehearsed all that God had done with them, and how he had opened the door of faith unto the Gentiles.  And there they abode long time with the disciples.\"*\n\n\nThis passage is a kind of summary passage.  It tells us that Paul went to a few other places and then went back and visited the places where they had preached.  It's Paul and Barnabas's missionary journey in reverse.\n\nBut here is the idea, the one idea that you get from these verses - everywhere that Paul went - he left a church.\n\nIn fact, Paul wrote one of the books of the Bible - Galatians, right after this to these people.  Turn with me to Galatians 1.  Hold your finger here and then go there.\n\nLook at verses 1-2:\n\n> *\"Paul, an apostle, (not of men, neither by man, but by Jesus Christ, and God the Father, who raised him from the dead;) And all the brethren which are with me, unto the churches of Galatia\"*\n\nNotice that last phrase of verse 2: *\"To the churches of Galatia\"**\n\nEverywhere Paul has been would be considered \"Galatia\" and he was only in these places for a short time - just a few weeks or a few months - but he left behind churches.\n\nEver read \"Hansel and Gretel\" - you know how as they journeyed through the woods they left breadcrumbs.  Paul is journeying through the whole world and he's dropping churches everywhere he goes.\n\nNow, that should tell you something - and I think we'll make this our first point:\n\n## Christians need church\n\nChurch isn't some something that was made up to take up everyone's time. It's not an optional part of the Christian life.  Paul went around and preached the gospel, and as soon as he had converts he organized churches.  And when he went back through he wasn't visiting individual converts he was visiting individual churches.\n\nYou know, there are some people who think that the church is some kind of social club.  Or that the church is some optional add-on to the Christian life.  They want to buy the whole Christ thing, but they don't want to add the church package - because they don't want to make the weekly payments.  That's not how this works. \n\nSo that's the first thing I want you to see.  That Paul left churches because Christians need churches.\n\nIt's not a perfect analogy and I realize it - but it's mostly true.  You play baseball in the context of a field.  You are an astronaut in the context of outer space.  You live the Christian life in the context of a local church. \n\nSo Paul left all of these churches.  Ok.\n\nAll right, so I want you to think about this for a minute.  It's Ad 45 or something like that.  There are all of these baby churches that have only had Paul with them for a short time. In many cases Paul had to leave them early because of persecution. They are spread out all over the place and can't really fellowship with each other.\n\nThat's kind of a scary spot don't you think.  I mean - these churches are babies.  If I were to take Noah tomorrow and just leave him somewhere along the interstate in central Ohio to fend for himself - that would concern you wouldn't it?  That's almost what was going on with these churches - they were at best toddlers and they were being left to fend for themselves.\n\nSo we know that Christians need churches - what do churches need?\n\nThat's why I wanted to preach on this passage because it gives us three things - three tools that the church has at it's disposal.  \n\nLook again at our passage.  Verses 22-23 give us a kind of overview of how Paul handled these baby churches and what he trusted.  Look at those verses again:\n\n> *\"Confirming the souls of the disciples, and exhorting them to continue in the faith, and that we must through much tribulation enter into the kingdom of God. And when they had ordained them elders in every church, and had prayed with fasting, they commended them to the Lord, on whom they believed\"*\n\nOk, so here is my main point tonight.  My main point is that Paul could leave these churches as baby churches because they had three things.  These are the three things that churches need to stay healthy. They are three things that modern established churches need too.  Ready:\n\nThe first thing churches need is...\n\n## Apostolic Teaching (The Scriptures)\n\nPaul was an apostle, and as an apostle he gave guidance to the early church.  He went about confirming and exhorting the people.  He told them to continue in the faith - which refers to the teaching he gave them.  They needed his guidance.\n\nNow - you might be thinking - Pastor, we don't have apostles today. We don't have someone giving us this kind of apostolic teaching.  You are right.  We don't.\n\nBut we still have access to apostolic teaching.  Apostolic instruction for the church.  Do you know what we have?  Every book of the New Testament is recorded apostolic teaching.  We are reading apostolic teaching now.\n\nListen - the first thing that churches need is the Bible.  They need the New TEstament.  They need to be Bible churches.\n\nWhen Paul wrote a letter to an early pastor - his instruction was clear \"Preach the word.\"  More than programs, more than nice buildings, more than technology - more than any of that what churches need is the Bible.  They need the Bible.\n\nLook - there are much more exciting ways to speak to you than going through the Bible like we do here.  I could make up themes and topics - I do sometimes - and we could have a steady diet of just that and we could really ramp it up.  Or we could bring in some dynamic guy to get everyone jazzed up every week with funny stories.  But the main reason we don't do that, other than I just couldn't pull it off, is because that isn't what you need.  You need the scriptures.\n\nThere are a lot of churches today that I think have gone to the point of license.  They have nothing about them that identifies them as believers.  They live and act just like the world around them.  I don't think that's a good thing.  Do you know what they need?  They need the Bible.\n\nOn the other end of the spectrum are churches that are legalistic.  They are all about the rules.  They've got rules for everything. I was listening to a video the other day and the pastor was just going on and on about rules for this and rules for that.  I don't think that's how God intended them to live the Christian life.  But do you know what they need - they need the Bible.\n\n1 Peter 2:2\n\n> *\"As newborn babes, desire the sincere milk of the word, that ye may grow thereby\"*\n\nPeople need the Lord but people need the word.  That's how Christians grow.\n\nSo these churches had apostolic teaching and we have apostolic teaching.\n\nThe second thing these churches had was...\n\n## Elder Oversight (The Pastorate)\n\nNotice what the text says:\n\n> *\"And when they had ordained them elders in every church\"*\n\nThe second thing that Paul could trust as he left these baby churches alone was what this passage calls \"elders.\"  But these aren't \"elders\" in the sense that they are old.  You don't have to be ordained to be an old person.  These are the pastoral leadership of the church.  Sometimes they are called \"elders\", sometimes they are called \"bishops\", sometimes they are called \"pastors.\"  It's the same group of men, and actually, elder is the most common name in the New Testament. \n\nTurn with me to the book of Titus.  Titus 1. Look at verse 5:\n\n> *\"For this cause left I thee in Crete, that thou shouldest set in order the things that are wanting, and ordain elders in every city, as I had appointed thee\"*\n\nThis is a common thing.  They would start a church and immediately they would ordain the leadership of the church. The elders.  \n\nTurn to 1 Peter 5.  With me.  We'll look at verses 1-3:\n\n> *\"The elders which are among you I exhort, who am also an elder, and a witness of the sufferings of Christ, and also a partaker of the glory that shall be revealed: Feed the flock of God which is among you, taking the oversight thereof, not by constraint, but willingly; not for filthy lucre, but of a ready mind; Neither as being lords over God's heritage, but being ensamples to the flock. And when the chief Shepherd shall appear, ye shall receive a crown of glory that fadeth not away\"*\n\nSo we get a clearer picture of who these guys were.  They were the undershepherds.  They were to feed the flock.  They were to take oversight.  They were to lead by example.  They were pastors.\n\nListen, this is going to sound totally egotistical but I don't mean it to be.  Because I'm not indespesible as your pastor.  Ok.  But here this:  A church isn't a healthy church unless its:\n\n1- A Bible led church\n2- An elder led church\n\nThose are two safeguards and provisions God has given to the church.  The Bible and pastors.  So if a church is going to be healthy they need the Bible and pastors.\n\n---\n\nBut there is one more thing.  Look at verse 23 in our text one more time:\n\n> *\"they commended them to the Lord, on whom thy believed.\"*\n\nSo how could Paul just leave these baby churches?  They had Apostolic teaching - they had the Bible.  They had Pastoral leadership.  But there was one more thing they had, and it's something we overlook.  They had:\n\n## Divine Faithfulness (The Holy Ghost)\n\nListen to me.  Here this.  Please hear this.  God loves Bible Baptist church far more than I ever could.  Far, far more.\n\nEphesians 5:25 says:\n\n> *\"Husbands, love your wives, even as Christ also loved the church, and gave himself for it\"*\n\nJesus loves the church.  If what we have here is a true church - God is going to look out for it.  God is going to take care of it.\n\nOne of the most arrogant things I hear pastors say from time to time is \"This church needs me - I don't know what would happen to this church without me.\"  Ok - I get where they are coming from. Churches do need pastoral leadership - but God cares more about that church if it's a true church than that pastor ever could and God is looking out for it.\n\nChurches, if they are made up of believers, are made up of people who have the Holy Ghost living inside of them - and God will lead them.","sermon_mp3":[{"id":"attSX40dPob0qQMEw","url":"https://dl.airtable.com/bcOkgIJDSYOenuM2GDzX_2016%200522%20sun%20pm.mp3","filename":"2016 0522 sun pm.mp3","size":22089977,"type":"audio/mp3"}],"series":["recimYIKOri1oFH5g"],"service":"Sunday PM","date":"2016-05-22","bible_text":"Acts 14:21-28","speaker":["reczJXlkg63judAaw"],"speaker_name":["Ryan Hayden"],"speaker_bio":["Ryan Hayden has served as the pastor at Bible Baptist since 2011.  He loves simple, direct, Bible based preaching.  He blogs at pastorryanhayden.com and is the host of the podcast \"The Foolishness of Preaching\" as well as a daily devotional radio show."],"speaker_role":["Pastor"],"speaker_thumbnail":[{"id":"attiOBQEp50XuGPhA","url":"https://dl.airtable.com/LJGYxDMRxuJNDVwB8peA_Photo%20on%205-10-16%20at%206.26%20PM.jpg","filename":"Photo on 5-10-16 at 6.26 PM.jpg","type":"image/jpeg","size":52652,"width":375,"height":375,"smallThumbUrl":"https://dl.airtable.com/BvvqdOhNTveYIc1lb8fP_small_Photo%20on%205-10-16%20at%206.26%20PM.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/alezlQj3Qdm6UQIO2DQR_large_Photo%20on%205-10-16%20at%206.26%20PM.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"series_title":["Acts"],"series_description":["On Sunday mornings at Bible Baptist we are looking at the story of the first church and their expansion from a small group of people in Jerusalem to a worldwide movement."],"series_featured_image":[{"id":"attD0DHqFH8EMvReu","url":"https://dl.airtable.com/a2NVzZDAS1S6xmXrofvJ_Acts.jpg","filename":"Acts.jpg","type":"image/jpeg","size":751004,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/SaeGMTSM6CPhD1R0dp0A_small_Acts.jpg","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/i4y4njq3Tqeo3McczRC9_large_Acts.jpg","largeThumbWidth":256,"largeThumbHeight":144}],"ten_minutes":0,"updated_or_created_ten_minutes":0,"published":true}]
